/** @jsxImportSource @emotion/react */
import React, { useEffect, useState } from 'react'
import * as s from './style'
import { useLocation } from 'react-router-dom';

function MainLayout({children}) {
  const [time, setTime] = useState("");
    const location = useLocation().pathname.replace(/^\/main\//, '');

    console.log(location);
  useEffect(() => {
    const updateTime = () => {
      const now = new Date();
      const hours = String(now.getHours()).padStart(2, "0");
      const minutes = String(now.getMinutes()).padStart(2, "0");
      setTime(`${hours}:${minutes}`);
    };

    updateTime(); // 초기 시간 설정
    const interval = setInterval(updateTime, 1000); // 1초마다 갱신

    return () => clearInterval(interval); // 컴포넌트 언마운트 시 정리
  }, []);
  return (
    <div css={s.container}>
      <div css={s.layout}>
        <header css={s.top_bar}>
            <span css={s.time}>{time}</span>
              <div css={s.icons}>

                <svg width="20" height="13" viewBox="0 0 20 13" fill='none' xmlns="http://www.w3.org/2000/svg">
                  <path fillRule="evenodd" clipRule="evenodd" d="M19.7 1.68205C19.7 1.04901 19.2224 0.535824 18.6333 0.535824H17.5667C16.9776 0.535824 16.5 1.04901 16.5 1.68205V11.616C16.5 12.2491 16.9776 12.7622 17.5667 12.7622H18.6333C19.2224 12.7622 19.7 12.2491 19.7 11.616V1.68205ZM12.2659 2.98111H13.3326C13.9217 2.98111 14.3992 3.50661 14.3992 4.15484V11.5885C14.3992 12.2367 13.9217 12.7622 13.3326 12.7622H12.2659C11.6768 12.7622 11.1992 12.2367 11.1992 11.5885V4.15484C11.1992 3.50661 11.6768 2.98111 12.2659 2.98111ZM7.93411 5.63015H6.86745C6.27834 5.63015 5.80078 6.16234 5.80078 6.81883V11.5735C5.80078 12.23 6.27834 12.7622 6.86745 12.7622H7.93411C8.52322 12.7622 9.00078 12.23 9.00078 11.5735V6.81883C9.00078 6.16234 8.52322 5.63015 7.93411 5.63015ZM2.63333 8.07545H1.56667C0.977563 8.07545 0.5 8.60003 0.5 9.24715V11.5905C0.5 12.2377 0.977563 12.7622 1.56667 12.7622H2.63333C3.22244 12.7622 3.7 12.2377 3.7 11.5905V9.24715C3.7 8.60003 3.22244 8.07545 2.63333 8.07545Z" fill="black"/>
                </svg>
                
                <svg width="18" height="13" viewBox="0 0 18 13" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path fillRule="evenodd" clipRule="evenodd" d="M8.77053 3.10404C11.2576 3.10414 13.6496 4.02623 15.4522 5.67971C15.5879 5.80736 15.8048 5.80575 15.9385 5.6761L17.236 4.41263C17.3037 4.34687 17.3414 4.25779 17.3409 4.16511C17.3403 4.07243 17.3015 3.98379 17.233 3.91879C12.502 -0.455922 5.03829 -0.455922 0.307282 3.91879C0.23875 3.98374 0.199866 4.07235 0.199234 4.16504C0.198602 4.25772 0.236275 4.34682 0.303915 4.41263L1.60178 5.6761C1.73538 5.80595 1.9525 5.80756 2.08815 5.67971C3.89089 4.02612 6.28317 3.10403 8.77053 3.10404ZM8.76717 7.32431C10.1245 7.32423 11.4334 7.83597 12.4395 8.7601C12.5756 8.89125 12.7899 8.88841 12.9226 8.75369L14.2099 7.43438C14.2777 7.36518 14.3153 7.2713 14.3143 7.17375C14.3133 7.0762 14.2738 6.98312 14.2047 6.91533C11.1408 4.02448 6.39611 4.02448 3.33227 6.91533C3.26307 6.98312 3.22358 7.07625 3.22267 7.17383C3.22176 7.27141 3.25951 7.36528 3.32744 7.43438L4.61435 8.75369C4.74701 8.88841 4.96137 8.89125 5.09746 8.7601C6.10291 7.83658 7.41075 7.32488 8.76717 7.32431ZM11.2916 10.1179C11.2935 10.2232 11.2565 10.3248 11.1892 10.3986L9.0125 12.8533C8.94869 12.9255 8.8617 12.9661 8.77093 12.9661C8.68016 12.9661 8.59317 12.9255 8.52936 12.8533L6.35233 10.3986C6.28508 10.3247 6.24808 10.2231 6.25008 10.1178C6.25207 10.0124 6.29288 9.91267 6.36287 9.84205C7.75296 8.52816 9.78889 8.52816 11.179 9.84205C11.2489 9.91272 11.2897 10.0125 11.2916 10.1179Z" fill="black"/>
                </svg>
                
                <svg width="28" height="13" viewBox="0 0 28 13" fill="none" xmlns="http://www.w3.org/2000/svg">
                <rect opacity="0.35" x="1" y="0.5" width="24" height="12" rx="3.8" stroke="black"/>
                <path opacity="0.4" d="M26.5 4.78113V8.8566C27.3047 8.51143 27.828 7.70847 27.828 6.81886C27.828 5.92926 27.3047 5.1263 26.5 4.78113Z" fill="black"/>
                <rect x="2.5" y="2" width="21" height="9" rx="2.5" fill="black"/>
                </svg>
              </div>
        </header>
        <main css={s.main_layout}>
          {children}
        </main>
          <footer css={s.bar}>
            <div css={s.bottom_icons}>
                <svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M6.25006 15.9494C6.25006 14.2522 6.25006 13.4036 6.59314 12.6577C6.93621 11.9118 7.58052 11.3595 8.86913 10.255L10.1191 9.18358C12.4483 7.18717 13.6128 6.18896 15.0001 6.18896C16.3873 6.18896 17.5518 7.18717 19.881 9.18358L21.131 10.255C22.4196 11.3595 23.0639 11.9118 23.407 12.6577C23.7501 13.4036 23.7501 14.2522 23.7501 15.9494V21.2499C23.7501 23.6069 23.7501 24.7855 23.0178 25.5177C22.2856 26.2499 21.1071 26.2499 18.7501 26.2499H11.2501C8.89304 26.2499 7.71453 26.2499 6.98229 25.5177C6.25006 24.7855 6.25006 23.6069 6.25006 21.2499V15.9494Z" stroke={location == 'home'? '#FF6B6B': '#33363F'} stroke-width="1.04167"/>
                <path d="M18.1251 26.25V19.7917C18.1251 19.2164 17.6587 18.75 17.0834 18.75H12.9167C12.3414 18.75 11.8751 19.2164 11.8751 19.7917V26.25" stroke={location == 'home'? '#FF6B6B': '#33363F'} stroke-width="1.04167" stroke-linecap="round" stroke-linejoin="round"/>
                </svg>
                <p style={{ color: location === 'home' ? '#FF6B6B' : '' }}>홈</p>

            </div>
                <div css={s.bottom_icons}>
                    <svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <circle cx="13.75" cy="13.75" r="8.75" stroke={location == 'quest'? '#FF6B6B': '#33363F'} stroke-width="1.04"/>
                    <path d="M13.7501 10C13.2576 10 12.77 10.097 12.315 10.2855C11.86 10.4739 11.4466 10.7501 11.0984 11.0983C10.7502 11.4466 10.474 11.86 10.2855 12.3149C10.0971 12.7699 10.0001 13.2575 10.0001 13.75" stroke={location == 'quest'? '#FF6B6B': '#33363F'} stroke-width="1.04" stroke-linecap="round"/>
                    <path d="M25 25L21 21" stroke={location == 'quest'? '#FF6B6B': '#33363F'}stroke-width="1.04" stroke-linecap="round"/>
                    </svg>
                    <p style={{ color: location === 'quest' ? '#FF6B6B' : '' }}>탐색</p>
                </div>
                <div css={s.bottom_icons}>
                    <svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <circle cx="15" cy="16.25" r="8.75" stroke={location == 'reservation'? '#FF6B6B': '#33363F'}/>
                    <path d="M6.25 6.25L3.75 8.75" stroke={location == 'reservation'? '#FF6B6B': '#33363F'} stroke-linecap="round"/>
                    <path d="M23.75 6.25L26.25 8.75" stroke={location == 'reservation'? '#FF6B6B': '#33363F'} stroke-linecap="round"/>
                    <path d="M11.25 13.75L14.5626 15.9584C14.8101 16.1234 15.1426 16.0718 15.3284 15.8395L17.5 13.125"stroke={location == 'reservation'? '#FF6B6B': '#33363F'} stroke-linecap="round"/>
                    </svg>
                    <p style={{ color: location === 'reservation' ? '#FF6B6B' : '' }}>예약</p>
                </div>
                <div css={s.bottom_icons}>
                        <svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M3.75012 13.125C3.75012 12.3515 3.75012 11.9648 3.84246 11.6493C4.0621 10.8988 4.64896 10.312 5.39943 10.0923C5.71493 10 6.10166 10 6.87512 10H23.1251C23.8986 10 24.2853 10 24.6008 10.0923C25.3513 10.312 25.9381 10.8988 26.1578 11.6493C26.2501 11.9648 26.2501 12.3515 26.2501 13.125V14.375C26.2501 15.4105 25.4107 16.25 24.3751 16.25V16.25C23.3396 16.25 22.5001 17.0895 22.5001 18.125V20.625C22.5001 22.5819 22.5001 23.5603 21.9418 24.2063C21.8691 24.2903 21.7905 24.369 21.7064 24.4416C21.0604 25 20.082 25 18.1251 25H11.8751C9.91826 25 8.93982 25 8.29384 24.4416C8.20979 24.369 8.13113 24.2903 8.05848 24.2063C7.50012 23.5603 7.50012 22.5819 7.50012 20.625V18.125C7.50012 17.0895 6.66066 16.25 5.62512 16.25V16.25C4.58959 16.25 3.75012 15.4105 3.75012 14.375V13.125Z" stroke={location == 'mileage'? '#FF6B6B': '#33363F'}/>
                        <path d="M6.25012 16.25H23.7501" stroke={location == 'mileage'? '#FF6B6B': '#33363F'} stroke-linecap="round"/>
                        <path d="M15.0001 8.75L15.0001 25" stroke={location == 'mileage'? '#FF6B6B': '#33363F'} stroke-linecap="round"/>
                        <path d="M15.0001 8.75L13.9019 7.65181C12.569 6.31892 10.9441 5.31467 9.15587 4.71858V4.71858C7.72636 4.24208 6.25012 5.30609 6.25012 6.81293V7.04057C6.25012 8.06142 6.90336 8.96775 7.87183 9.29057L10.0001 10" stroke={location == 'mileage'? '#FF6B6B': '#33363F'} stroke-linecap="round"/>
                        <path d="M15.0001 8.75L16.0983 7.65181C17.4312 6.31892 19.0561 5.31467 20.8444 4.71858V4.71858C22.2739 4.24208 23.7501 5.30609 23.7501 6.81293V7.04057C23.7501 8.06142 23.0969 8.96775 22.1284 9.29057L20.0001 10" stroke={location == 'mileage'? '#FF6B6B': '#33363F'} stroke-linecap="round"/>
                        </svg>

                <p style={{ color: location === 'mileage' ? '#FF6B6B' : '' }}>마일리지</p>
                </div>
                    <div css={s.bottom_icons}>
                    <svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <circle cx="15" cy="10" r="4.5" stroke={location == 'my'? '#FF6B6B': '#33363F'} stroke-linecap="round"/>
                    <path d="M5.90054 21.8423C6.75411 17.9036 10.471 16.875 14.5012 16.875H15.4988C19.529 16.875 23.2459 17.9036 24.0995 21.8423V21.8423C24.2934 22.7373 23.6326 24.375 22.7167 24.375H7.2833C6.36745 24.375 5.70656 22.7373 5.90054 21.8423V21.8423Z" stroke={location == 'my'? '#FF6B6B': '#33363F'} stroke-linecap="round"/>
                    </svg>

                <p style={{ color: location === 'my' ? '#FF6B6B' : '' }}>MY</p>
            </div>
        </footer>
      </div>
    </div>
  )
}
export default MainLayout